Repository: Bambofy/mkd-mirror
Catalog: src-mkddocu/lang/po/mkddocu_*.po
Languages: fr

source: Please install mkd software
fr: S'il vous plaît, installez la commande mkd

source: Syntax :
fr: Syntaxe :

source: mkddocu <target_dir>
fr: mkddocu <répertoire_cible>

source: -> example of series with date : mkddocu 2014-02-22
fr: → exemple de series avec date : mkddocu 2014-02-22

source: The target directory is also writen in maintenance directory :
fr: Le répertoire cible est généré dans le répertoire maintenance :

source: mkddocu ? for this help
fr: mkddocu ? pour la syntaxe

source: Last backup before maintenance :
fr: Dernière sauvegarde avant maintenance :

source: Make backup in Backups dir, yes ? Your choice : y ?
fr: Faire une sauvegarde dans le répertoire Backups ? choix : (y pour oui) y ?

source: If the directory
fr: Si le répertoire

source: does not exist, create it
fr: n'existe pas, il sera créé

source: Files in directory
fr: Fichiers dans le répertoire

source: return -2
fr: retourne -2

source: -> Create header file in
fr: → crée un fichier d'entête, dans

source: (benchmark H)
fr: (repère H)

source: -> Warning : Copy manually the header file in current source directory
fr: → Attention : Copier manuellement le fichier d'entête dans le répertoire source

source: C files not found
fr: Pas de fichier C trouvé

source: Creating documentation, find the programming style, with the benchmark D
fr: Crée la documentation, trouve le style de programmation, avec le repère D

source: Creates the tests document and the directives of tests, with the benchmark T
fr: Crée le document des tests et directives de tests, avec le repère T

source: Creates the document for the maintainers, with the benchmark P
fr: Crée le document à l'usage des mainteneurs, avec le repère P

source: Creates a file with strings, and a file with strings for tranlations, with benchmark **
fr: Crée le fichier des chaînes de caractères pour les traductions, avec le repère '**'

source: See in working directory:
fr: Voyez le répertoire

source: end normal, return 0
fr: Fin normale, retourne 0
